solitary3DPorous/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0.00125;

seaLevelAsReference true;

relaxationNames     ( );

initializationName  inlet;

porosityModel       jensenJacobsenChristensen2014;

inletCoeffs
{
    waveType            chappelear1962;
    height              0.15;
    depth               0.50125;
    direction           ( 1 0 0 );
    x0                  ( -10 0 0 );
    L1                  0.11002;
    L3                  -0.109568;

    GABCSettings
    {
        preProcessMethod    polynomialDefault;
        defaultRange        "kh000_030";
        shapeFunction       P03Celerity;
        a0                  1.6207;
        a1                  0;
        a2                  -2.7209;
        a3                  1.5429;
        depth               0.50125;
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;

    GABCSettings
    {
        preProcessMethod    polynomialDefault;
        defaultRange        "kh000_030";
        shapeFunction       P03Celerity;
        a0                  1.6207;
        a1                  0;
        a2                  -2.7209;
        a3                  1.5429;
        depth               0.50125;
    }
}



// ************************************************************************* //
