solitary3DPorous/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0.00125;
seaLevelAsReference true;

relaxationNames     ();

initializationName  inlet;

porosityModel jensenJacobsenChristensen2014;

inletCoeffs
{
    waveType    chappelear1962;

    x0          (-10 0 0);
    
    height      0.15;
    depth       0.50125;
    direction   (1 0 0);

    GABCSettings
    {
        preProcessMethod   polynomialDefault;
        defaultRange       "kh000_030";
    }
}


outletCoeffs
{
    waveType potentialCurrent;
    U        (0 0 0);
    Tsoft    2.0;

    GABCSettings
    {
        preProcessMethod   polynomialDefault;
        defaultRange       "kh000_030";
        depth              0.50125;
    }
}


// ************************************************************************* //
